package org.example.lessons.lesson12.homeworks

fun main() {
    var collectionNumber = listOf(15, -45, 4, null, 97, 0, 45, 7895, 1, 45, 6)
    var collectionString = listOf("cat", "elephant", "crocodile", "dog", "mouse")
//Задачи на приведение коллекции к значению
//1. Проверить, что размер коллекции больше 5 элементов.
    println(collectionNumber.size > 5)
//Проверить, что коллекция пустая
    println(collectionNumber.isEmpty())
//Проверить, что коллекция не пустая
    println(collectionNumber.isNotEmpty())
//Взять элемент по индексу или создать значение если индекса не существует
    println(collectionNumber.getOrElse(5) { "it`s shorter" })
//Собрать коллекцию в строку
    println(collectionNumber.joinToString(", "))
//Посчитать сумму всех значений
    println(
        collectionNumber
            .filterNotNull()
            .sum()
    )
    println(collectionNumber.sumOf { it ?: 0 })
//Посчитать среднее
    println(
        collectionNumber
            .filterNotNull()
            .average()
    )
//Взять максимальное число
    println(
        collectionNumber
            .filterNotNull()
            .maxOrNull()
    ) // Null если коллекция пуста
//Взять минимальное число
    println(
        collectionNumber
            .filterNotNull()
            .minOrNull()
    )
//Взять первое число или null
    println(collectionNumber.firstOrNull())
//Проверить что коллекция содержит элемент
    println(collectionNumber.contains(12))

//    Задачи на обработку коллекций
//    Отфильтровать коллекцию по диапазону 18-30
    println(
        collectionNumber
            .filterNotNull()
            .filter { it in 18..30 })
//    Выбрать числа, которые не делятся на 2 и 3 одновременно
    println(
        collectionNumber
            .filterNotNull()
            .filter { it % 2 != 0 && it % 2 != 0 })
//    Очистить текстовую коллекцию от null элементов
    println(collectionNumber.filterNotNull())
//    Преобразовать текстовую коллекцию в коллекцию длин слов
    println(collectionString.map { it.length })
//    Преобразовать текстовую коллекцию в мапу, где ключи - перевёрнутые слова, а значения - длина слов
    println(
        collectionString
            .associate { it.reversed() to it.length })
//    Отсортировать список в алфавитном порядке
    println(collectionString.sorted())
//    Взять первые 3 элемента списка
    println(collectionString.take(3))
//    Распечатать квадраты элементов списка
    println(
        collectionNumber
            .filterNotNull()
            .forEach { it * it }
    )
//    Группировать список по первой букве слов
    println(
        collectionString
            .filterNotNull()
            .groupBy { it.first() })
//    Очистить список от дублей
    println(collectionNumber.distinct())
//    Отсортировать список по убыванию
    println(collectionNumber.sortedByDescending { it ?: 0 })
//    Взять последние 3 элемента списка
    println(collectionNumber.takeLast(3))


    println(numberCollectionCharacteristic(emptyList()))
    println(numberCollectionCharacteristic(listOf(1, 2, 3)))
    println( numberCollectionCharacteristic(listOf(0, 1, 2, 3, 4)))
    println(numberCollectionCharacteristic(listOf(1, 10000, 1, 1, 1)))
    numberCollectionCharacteristic(listOf(10, 10, 10, 10, 10))
    numberCollectionCharacteristic(listOf(1, 2, 3, 4, 5, 6, 77))
    numberCollectionCharacteristic(listOf(-15, -12, -13, -14, -20))
    numberCollectionCharacteristic(listOf(1001, 1001, 1001, 1001, 1001))
    numberCollectionCharacteristic(listOf(1, 2, 3, 14, 5))
    numberCollectionCharacteristic(listOf(1, 2, 4, 5, 6))


    val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
    println(gradesAnalizer(grades))

    val list = listOf("Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка")
    println(furnitureMap(list))
    println(averageLength(list))

    val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
    println(oddOrEvenDefiner(numbers))
    val ages = listOf(22, 18, 30, 45, 17, null, 60)
    println(elementFinder(ages, 18))
}

//Задача 24. Характеристика числовой коллекции
//Напиши функцию, которая принимает коллекцию чисел и возвращает строку с характеристикой коллекции используя конструкцию when
//
//Если коллекция пустая - “Пусто”
//Если количество элементов меньше пяти - “Короткая”
//Если коллекция начинается с 0 - “Стартовая”
//Если сумма всех чисел больше 10000 - “Массивная”
//Если среднее значение равно 10 - “Сбалансированная”
//Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
//Если максимальное число меньше -10 - “Отрицательная”
//Если минимальное число больше 1000 - “Положительная”
//Если содержит одновременно числа 3 и 14 - “Пи***тая”
//Иначе - “Уникальная”
//Вызвать метод с данными, подходящими под каждую из веток
//
fun numberCollectionCharacteristic(a: List<Int>): String {
    return when {
        a.isEmpty() -> "Пусто"
        a.size < 5 -> "Короткая" //Если количество элементов меньше пяти - “Короткая”
        a.first() == 0 -> "Стартовая" //Если коллекция начинается с 0 - “Стартовая”
        a.sum() > 10000 -> "Массивная"//Если сумма всех чисел больше 10000 - “Массивная”
        a.average() == 10.0 -> "Сбалансированная" //Если среднее значение равно 10 - “Сбалансированная”
        a
            .joinToString()
            .length == 20 -> "Клейкая" //Если длина строки образованная склеиванием коллекции в строку равна 20 - “Клейкая”
        a.max() < -10 -> "Отрицательная" //Если максимальное число меньше -10 - “Отрицательная”
        a.min() > 1000 -> "Положительная" //Если минимальное число больше 1000 - “Положительная”
        a.contains(3) && a.contains(14) -> "Пи***тая" //Если содержит одновременно числа 3 и 14 - “Пи***тая”
        else -> "Уникальная"//Иначе - “Уникальная”
    }
}

//Задача 25. Анализ учебных оценок
//Напиши функцию, которая принимает список чисел и возвращает список чисел.
fun gradesAnalizer(list: List<Int>): List<Int> {
    return list
        .filter { it >= 60 }
        .sorted()
        .take(3)
}

//Пример данных: val grades = listOf(85, 58, 90, 74, 88, 67, 95, 92, 50, 42, 12)
//
//Цель: Отфильтровать удовлетворительные оценки (>=60), отсортировать оставшиеся по возрастанию и взять первые 3.
// Вызывай методы обработки и фильтрации последовательно один из другого, чтобы результат предыдущего метода являлся основой для следующего.
//
//Задача 26. Создание каталога по первой букве
//Напиши функцию, которая принимает список строк и возвращает словарь с ключом - буквой и значением - списком строк.
//Цель: Привести все слова в списке к нижнему регистру, сгруппировать в каталог по первой букве используя метод groupBy
fun furnitureMap(list: List<String>): Map<Char, List<String>> {
    return list
        .map { it.lowercase() }
        .groupBy { it.first() }
}
//Начальные значения: val list = listOf(
//    "Стол", "табурет", "ваза", "Кружка", "Зеркало", "ковер", "Шкаф", "часы", "Люстра", "подушка", "Картина", "столик", "Вазон", "шторы", "Пуф", "книга", "Фоторамка", "светильник", "Коврик", "вешалка", "Подставка", "телевизор", "Комод", "полка", "Абажур", "диван", "Кресло", "занавеска", "Бра", "пепельница", "Глобус", "статуэтка", "Поднос", "фигурка", "Ключница", "плед", "Тумба", "игрушка", "Настенные часы", "подсвечник", "Журнальный столик", "сувенир", "Корзина для белья", "посуда", "Настольная лампа", "торшер", "Этажерка"//)
//

//
//Задание 27. Подсчёт средней длины слов в списке
//Напиши функцию, которая принимает список строк и возвращает строку.
//Цель: Перевести все слова в количество букв, подсчитать среднее значение. Вернуть форматированный текст с двумя знаками после запятой, используя функцию format и подходящий шаблон.
//Начальные значения взять из предыдущей задачи.
//
fun averageLength(list: List<String>): String {
    val average = list
        .map { it.length }
        .average()
    return String.format("%.2f", average)
}

//
//Задание 28: Категоризация чисел
//Напиши функцию, которая принимает список чисел и возвращает словарь с ключами - строками и значениями - список чисел.
//Цель: Отобрать уникальные числа, отсортировать по убыванию и сгруппировать по четности (“четные” и “нечетные”).
//Начальные значения: val numbers = listOf(1, 3, 5, 7, 3, 1, 8, 9, 9, 7)
//
fun oddOrEvenDefiner(list: List<Int>): Map<String, List<Int>> {
    return list
        .distinct()
        .sortedDescending()
        .groupBy { if (it % 2 == 0) "четные" else "нечетные" }
}

//
//Задание 29: Поиск первого подходящего элемента
//Напиши функцию, которая принимает список чисел и число и возвращает nullable число.
//Цель: Найти первый возраст в списке, который соответствует условию (больше второго аргумента) и вернуть его, либо null если значения не нашлось.
//Начальные значения: val ages = listOf(22, 18, 30, 45, 17, null, 60) и число для проверки возраста, например 18.//
fun elementFinder(list: List<Int?>, element: Int): Int? {
    return list
        .filterNotNull()
        .firstOrNull { it > element }
}